package lielietea.mirai.plugin.core.responder.mahjong;

import java.util.ArrayList;
import java.util.Arrays;

public class MahjongSay {
    static final ArrayList<String> luck = new ArrayList<>(Arrays.asList(
            "大凶",//一筒
            "末吉",
            "吉",
            "吉凶相半",
            "吉",
            "末吉",
            "大大吉",//七筒
            "吉",
            "小凶後吉",//九筒
            "吉",//一条
            "末吉",
            "吉",
            "小凶後吉",
            "吉",
            "末吉",
            "大吉",
            "吉凶相半",
            "吉",//九条
            "末吉",//一万
            "半吉",
            "凶後吉",
            "半吉",
            "末吉",
            "半吉",
            "大凶",
            "半吉",
            "吉凶相半",//九万
            "半吉",//东
            "末吉",//南
            "凶後大吉",//西
            "凶後吉",//北
            "小吉",//中
            "小凶後吉",//白
            "大吉",//发
            "吉凶相半",//春
            "小吉",
            "末吉",
            "小吉",//冬
            "大吉",//梅
            "中吉",
            "大吉",
            "中吉" //菊
    ));
    static final ArrayList<String> saying = new ArrayList<>(Arrays.asList(
            "别出门了，今天注意安全。",//一筒
            "是吉是凶并不清楚，暂定为吉！",
            "还算不错！",
            "吉凶各一半，要小心哦！",
            "其实还不错！",
            "是吉是凶并不清楚，暂定为吉！",
            "实现愿望的最高幸运，今天你会心想事成！",//七筒
            "还不错！",
            "丢失的运气会补回来的！",//九筒
            "还不错！",//一条
            "是吉是凶并不清楚，暂定为吉！",
            "还可以的！",
            "丢失的运气会补回来的！",
            "还不错！",
            "是吉是凶并不清楚，暂定为吉！",
            "是仅次于大大吉的超级好运！",
            "吉凶各一半，要小心哦！",
            "还不错！",//九条
            "是吉是凶并不清楚，暂定为吉！",//一万
            "勉勉强强的好运！",
            "一阵不走运之后会好运的！",
            "勉勉强强的好运！",
            "是吉是凶并不清楚，暂定为吉！",
            "勉勉强强的好运！",
            "别出门了，今天注意安全。",
            "勉勉强强的好运！",
            "吉凶各一半，小心一些总不会错！",//九万
            "勉勉强强的好运！",//东
            "是吉是凶并不清楚，暂定为吉！",//南
            "一阵不走运之后会行大运的！",//西
            "一阵不走运之后会好运的！",//北
            "微小但一定会到来的好运！",//中
            "丢失的运气会补回来的！",//白
            "是仅次于大大吉的超级好运！会有很好的财运！",//发
            "吉凶各一半，要小心哦！",//春
            "微小但一定会到来的好运！",
            "是吉是凶并不清楚，暂定为吉！",
            "微小但一定会到来的好运！",//冬
            "是仅次于大大吉的超级好运！",//梅
            "非常好的运气！",
            "是仅次于大大吉的超级好运！",
            "非常好的运气！姻缘不错！" //菊
    ));
}
